#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform will perform the following actions:

  # module.KEYCLOAK_PROD.module.moh_applications.module.MANAGE-USERS.keycloak_role.REALM_ROLE will be updated in-place
  ~ resource "keycloak_role" "REALM_ROLE" {
      ~ composite_roles = [
          - "23bc42da-7a1d-4169-bf14-ac37561dc5c7",
            # (27 unchanged elements hidden)
        ]
        id              = "eeac5c0a-7b1b-4607-ad95-1630769b5892"
        name            = "Manage Users"
        # (3 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-VIHACERNER-ACCESS.keycloak_openid_audience_protocol_mapper.prime-web-api will be created
  + resource "keycloak_openid_audience_protocol_mapper" "prime-web-api" {
      + add_to_access_token      = true
      + add_to_id_token          = false
      + client_id                = (known after apply)
      + id                       = (known after apply)
      + included_custom_audience = "prime-web-api"
      + name                     = "prime-web-api"
      + realm_id                 = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-VIHACERNER-ACCESS.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PRIME-VIHACERNER-ACCESS"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = false
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-VIHACERNER-ACCESS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PRIME-APPLICATION-LOCAL/external_hpdid_access"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "7d19c8ab-0b8c-491e-8e81-b743abdc1d03"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-VIHACERNER-ACCESS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PRIME-APPLICATION-TEST/external_hpdid_access"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "1fbecc4c-9396-46ac-aaa5-4ae270cabdc2"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-VIHACERNER-ACCESS.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-VIHACERNER-ACCESS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PRIME-APPLICATION-LOCAL/external_hpdid_access"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "13c072db-b202-46d9-a462-8da22bff5e0d"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "external_hpdid_access"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIME-VIHACERNER-ACCESS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PRIME-APPLICATION-TEST/external_hpdid_access"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2fcdbbc7-56c4-4f25-8c50-27f05947b4f6"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "external_hpdid_access"
      + service_account_user_id = (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @daveb-hni, Action: `pull_request`*